&НаСервере
Процедура ПровестиДокументы222(Параметры, АдресРезультата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ПОМЕСТИТЬ втДоговоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И &ДатаЗапроса МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Договор.Ссылка КАК Реализации
	|ПОМЕСТИТЬ втРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДоговоры.Договор.Ссылка КАК ДоговорСсылка
	|ИЗ
	|	втДоговоры КАК втДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
	|		ПО (втРеализации.Реализации.Ссылка = втДоговоры.Договор.Ссылка)
	|ГДЕ
	|	втРеализации.Реализации.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ДатаЗапроса", Параметры.НачалоПериода);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТекущийДокумент = 1;
	ВсегоДокументов = Результат.Количество();
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда 
		
		Для каждого ЭлементРезультата Из Результат Цикл
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Контрагент = ЭлементРезультата.ДоговорСсылка.Владелец;
			НовыйДокумент.Договор	 = ЭлементРезультата.ДоговорСсылка.Ссылка;
			НовыйДокумент.Организация = ЭлементРезультата.ДоговорСсылка.Организация;
			НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НовыйДокумент.Дата		 = Параметры.КонецПериода;
			НовыйДокумент.ВыполнитьАвтозаполнение();
			
			Если ЗначениеЗаполнено(НовыйДокумент.Услуги) Тогда
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				тчДокументы = Документы.Добавить();
				тчДокументы.Договор = НовыйДокумент.Договор.Ссылка;
				тчДокументы.Реализация = НовыйДокумент.Ссылка;
				
			Иначе 
				Клиент = НовыйДокумент.Контрагент;
				Договор = НовыйДокумент.Договор;
				ТекстСообщения = СтрШаблон("Клиенту %1 по договору %2 за %3 услуг не предоставлялось",
												Клиент, Договор, Формат(Параметры.КонецПериода, "ДФ='MMMM yyyy'"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;
			
			ПроцентВыполнения = (ТекущийДокумент/ВсегоДокументов)*100;
			ПроцентВыполнения = Окр(ПроцентВыполнения,0);
			
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,СокрЛП(НовыйДокумент.Ссылка));
			ТекущийДокумент = ТекущийДокумент + 1; 
			
		КонецЦикла;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("За указанный период документы уже созданы");
		
	КонецЕсли;
			
КонецПроцедуры	
