
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоМесяца(ТекущаяДатаСеанса()), КонецМесяца(ТекущаяДатаСеанса()));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка,
	|	ВКМ_ОбслуживаниеКлиента.ВКМ_ДатаПроведенияРабот КАК ДатаРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВКМ_ВремяНачалаРабот КАК ВремяС,
	|	ВКМ_ОбслуживаниеКлиента.ВКМ_ВремяОкончанияРабот КАК ВремяПо,
	|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК Специалист
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.ПометкаУдаления = ЛОЖЬ
	|	И ВКМ_ОбслуживаниеКлиента.Проведен = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДатаНачала = СоединитьДатуИВремя(Выборка.ДатаРабот, Выборка.ВремяС);
		ДатаКонца = СоединитьДатуИВремя(Выборка.ДатаРабот, Выборка.ВремяПо);
		
		ЭлементПланировщика = Планировщик.Элементы.Добавить(ДатаНачала, ДатаКонца);
		ЭлементПланировщика.Значение = Выборка.Ссылка;
		ЭлементПланировщика.Текст = Выборка.Специалист;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоединитьДатуИВремя(Дата, Время) Экспорт
	
	ДатаСтрока = Формат(Дата, "ДФ=""ггггММдд""");
	ВремяСтрока = Формат(Время, "ДФ=""ЧЧммсс""");
	ДатаВремя = Дата(ДатаСтрока + ВремяСтрока);
	
	Возврат ДатаВремя;
	
КонецФункции   



