
Процедура ТелеграмБотСообщение(ТекстСообщения) Экспорт
	
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,, Новый ЗащищенноеСоединениеOpenSSL);
	
	СтрокаЗапроса = СтрШаблон("/bot%1/sendMessage", Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить());
	
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	ШаблонСообщения = ТекстСообщения;
	
	ТелоОбъекта = Новый Структура;
	ТелоОбъекта.Вставить("chat_id", ИдентификаторГруппы);
	ТелоОбъекта.Вставить("text", ШаблонСообщения);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, ТелоОбъекта);
	ТелоЗапроса = Запись.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса); 
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Что-то пошло не так :(";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры
