
//Процедура ПередЗаписью(Отказ)

//   	Если ЭтоНовый() Тогда 
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ ПЕРВЫЕ 1
//		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Основание,
//		|	ВКМ_УведомленияТелеграмБоту.Текст КАК ТекстСообщения
//		|ИЗ
//		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
//		|ГДЕ
//		|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления = ЛОЖЬ
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	ВКМ_УведомленияТелеграмБоту.Ссылка УБЫВ";
//		
//		Выборка = Запрос.Выполнить().Выбрать();
//		
//		Пока Выборка.Следующий() Цикл
//			
//			СообщениеБоту = СтрШаблон("%1 %2", Выборка.Основание, Выборка.ТекстСообщения);
//			
//			ВКМ_ОбщегоНазначенияТелеграмСервер.ТелеграмБотСообщение(СообщениеБоту);
//			
//			Сообщить("Это ушло в Телеграм " + СообщениеБоту);
//			
//		КонецЦикла;
//		
//	КонецЕсли

//КонецПроцедуры









