
Процедура ПередЗаписью(Отказ)

	Если ЭтоНовый() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.Текст КАК Текст
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВКМ_УведомленияТелеграмБоту.Ссылка УБЫВ";
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
						
			ВКМ_ОбщегоНазначенияТелеграмСервер.ТелеграмБотСообщение(СтрШаблон("%1 %2", Выборка.Ссылка, Выборка.Текст));		
			
		КонецЦикла;
		
	КонецЕсли;
			
КонецПроцедуры






