
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВКМ_ОбслуживаниеКлиента" Тогда
		
		СоздатьЗаписьСправочника(Параметр, Источник);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьСправочника(Параметр, Источник)
	
	ЗаписьВСправочник = Справочники.ВКМ_УведомленияТелеграмБоту;
	НоваяЗапись = ЗаписьВСправочник.СоздатьЭлемент();
	НоваяЗапись.Наименование = Источник;
	НоваяЗапись.ПолноеНаименование = Параметр; 
	
КонецПроцедуры


