
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ВКМ_ГрафикиОтпусков
	Движения.ВКМ_ГрафикиОтпусков.Записывать = Истина;
	
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ГрафикиОтпусков.Добавить();
		Движение.Дата = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.ДатаНачала = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаОтпускаСотрудников.ДатаОкончания;
		Движение.Год = Год;
		Движение.Регистратор = Ссылка;
		
	КонецЦикла;
    
КонецПроцедуры

#КонецОбласти
