
&НаКлиенте
Процедура Создать(Команда)
	
	ИдЗадания = "";
	Индикатор = 0;
	СтрокаСостояния = "";
	
	Если ПроверитьЗаполнение() Тогда
		
		ПараметрыЗапуска = Новый Структура;
		ПараметрыЗапуска.Вставить("НачалоПериода", НачалоМесяца(Объект.Период));
		ПараметрыЗапуска.Вставить("Конецпериода", КонецМесяца(Объект.Период));
		ПараметрыЗапуска.Вставить("ДатаДоговора", НачалоМесяца(Объект.Период));
		
		СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
		Интервал = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
		ИдЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.Интервал = 2;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, 
													Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект),
													ПараметрыОжидания);
				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Массовое Создание Актов";

	ВыполняемыйМетод = "Обработка.ВКМ_МассовоеСозданиеАктовВФоне.МодульОбъекта.ЗаполнитьНаСервере";
	
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
		
КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт
	
	ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		ЭтаФорма.СтрокаСостояния = "Ошибка";
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		ЭтаФорма.Индикатор = 100;
		ЭтаФорма.СтрокаСостояния = "Выполнено";
		Текст = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Сообщить(Текст);
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОтменитьНаСервере()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ОтменитьНаСервере();
КонецПроцедуры
