
Процедура ПередЗаписью(Отказ)
	
	// repin_pv 27.01.24 {{{ Считаю необходимым добавить - контроль создания дублирования договра по сроку действия
	ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончания
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ВКМ_ДатаОкончанияДействияДоговора < Выборка.ДатаОкончания Тогда
			
			//@skip-check unknown-method-property
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Действующий договор обслуживания уже создан");
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;	
	// }}} repin_pv 27.01.24 
	
КонецПроцедуры


