#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры 

&НаКлиенте
Процедура ВКМ_ВремяНачалаРаботПриИзменении(Элемент)
	
	НачалоПериода = Объект.ВКМ_ВремяНачалаРабот;
	КонецПериода = Объект.ВКМ_ВремяОкончанияРабот;
	
	Объект.ВКМ_Комментарий = ПолучитьРазностьДатВЧасах(НачалоПериода, КонецПериода);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВКМ_ВремяОкончанияРаботПриИзменении(Элемент)
	
	НачалоПериода = Объект.ВКМ_ВремяНачалаРабот;
	КонецПериода = Объект.ВКМ_ВремяОкончанияРабот;
	
	Объект.ВКМ_Комментарий = ПолучитьРазностьДатВЧасах(НачалоПериода, КонецПериода);
	
КонецПроцедуры

#КонецОбласти 

#Область РазмещенияФункций

&НаКлиенте
Функция ПолучитьРазностьДатВЧасах(НачалоПериода, КонецПериода)
	
	РазностьВЧасах = (НачалоМинуты(КонецПериода) - НачалоМинуты(НачалоПериода)) /3600;
	
	КоличествоЧасов = Окр(РазностьВЧасах, 1, 0);
	
	СтрокаЧасовКОплате = "час(ов) к оплате";
	
	Возврат СтрШаблон("%1 %2", КоличествоЧасов, СтрокаЧасовКОплате);
	
КонецФункции

#КонецОбласти 



