Процедура  ЗаполнитьНаСервере(Параметры, АдресРезультата) Экспорт 
					
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ПОМЕСТИТЬ втДоговоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И &ДатаДоговора МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Договор.Ссылка КАК Реализации
		|ПОМЕСТИТЬ втРеализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДоговоры.Договор.Ссылка КАК ДоговорСсылка
		|ИЗ
		|	втДоговоры КАК втДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
		|		ПО (втРеализации.Реализации.Ссылка = втДоговоры.Договор.Ссылка)
		|ГДЕ
		|	втРеализации.Реализации.Ссылка ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
		Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
		Запрос.УстановитьПараметр("ДатаДоговора", Параметры.ДатаДоговора);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		ВсегоДокументов = Результат.Количество();
		ТекДок = 0;
							
		Для каждого ЭлементРезультата Из Результат Цикл
			
			НовыйДокумент				= Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Контрагент	= ЭлементРезультата.ДоговорСсылка.Владелец;
			НовыйДокумент.Договор		= ЭлементРезультата.ДоговорСсылка.Наименование;
			НовыйДокумент.Организация	= ЭлементРезультата.ДоговорСсылка.Организация;
			НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НовыйДокумент.Дата			= Параметры.КонецПериода;
			НовыйДокумент.ВыполнитьАвтозаполнение();
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			тчДокументы = Параметры.Объект.Документы.Добавить();
			тчДокументы.Договор = НовыйДокумент.Договор.Ссылка;
			тчДокументы.ДокументРеализация = НовыйДокумент.Ссылка;
						
			ПроцентВыполнения = (ТекДок/ВсегоДокументов)*100;
			ПроцентВыполнения = Окр(ПроцентВыполнения,0);
			
			//МассивВозврат.Добавить(ПроцентВыполнения);
			
			// сообщаем "процент" и "текст сообщения"
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения);
			
			ТекДок = ТекДок + 1;
						
		КонецЦикла;
				
КонецПроцедуры