
&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	НачалоПериода = НачалоМесяца(Дата(Объект.Период));
	КонецПериода = КонецМесяца(Дата(Объект.Период));
	
	// repin_pv 25.11.23 {{{ Ранний возврат - если не указан ПЕРИОД
	Если Объект.Период = Дата("01.01.0001 0:00:00") Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан МЕСЯЦ");
		Возврат;
		
	КонецЕсли;
	// }}} repin_pv 25.11.23 
		
	ДлительнаяОперация = НачатьВыполнениеНаСервере(НачалоПериода, КонецПериода);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);	
	
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеНаСервере(НачалоПериода, КонецПериода)
	
	//ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);				
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(,"Обработки.ВКМ_ДлительнаяОпреация.МодульОбъекта.СоздатьДокументыНаСервере", НачалоПериода, КонецПериода); 
		
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПриЗавершенииРасчета();
	
КонецПроцедуры

Процедура ПриЗавершенииРасчета()
	
	Сообщить("У нас все получилось!");
	
КонецПроцедуры