#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// {{ Репин П.В.: 27.10.2023, Добавление реквизитов формы списка элемента "ДоговорыКонтрагентов" 
	
	ТаблицаФормы = Элементы.Список;
	КолонкаВставки = ТаблицаФормы.ПодчиненныеЭлементы.Найти("Ссылка");
	ПолеДатаНачалаДействияДоговора = Элементы.Вставить("_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ТаблицаФормы, КолонкаВставки);
	ПолеДатаНачалаДействияДоговора.Заголовок = "Дата начала действия договора";
	ПолеДатаНачалаДействияДоговора.ПутьКДанным = "Список.Ссылка.ВКМ_ДатаНачалаДействияДоговора"; 
	
	ПолеДатаОкончанияДействияДоговора = Элементы.Вставить("_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ТаблицаФормы, КолонкаВставки);
	ПолеДатаОкончанияДействияДоговора.Заголовок = "Дата окончания действия договора";
	ПолеДатаОкончанияДействияДоговора.ПутьКДанным = "Список.Ссылка.ВКМ_ДатаОкончанияДействияДоговора"; 
	
	ПолеСуммаАбонентскойПлаты = Элементы.Вставить("_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ТаблицаФормы, КолонкаВставки);
	ПолеСуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
	ПолеСуммаАбонентскойПлаты.ПутьКДанным = "Список.Ссылка.ВКМ_СуммаАбонентскойПлаты"; 
	
	ПолеСтоимостьЧасаРаботы = Элементы.Вставить("_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ТаблицаФормы, КолонкаВставки);
	ПолеСтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
	ПолеСтоимостьЧасаРаботы.ПутьКДанным = "Список.Ссылка.ВКМ_СтоимостьЧасаРаботы";
	
	// }}
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти


