
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ВКМ_Специалист) Тогда 
		
		ВКМ_Специалист = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	АбонентскоеОбслуживание = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор.ВидДоговора КАК ВидДоговора,
	|	ДЕНЬГОДА(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_ДатаПроведенияРабот) КАК ДатаРабот,
	|	ДЕНЬГОДА(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор.ВКМ_ДатаНачалаДействияДоговора) КАК ДатаНачала,
	|	ДЕНЬГОДА(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор.ВКМ_ДатаОкончанияДействияДоговора) КАК ДатаОкончания,
	|	ОКР(РАЗНОСТЬДАТ(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_ВремяНачалаРабот, ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_ВремяОкончанияРабот, МИНУТА) / 60, 1) * ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы КАК СуммаОплаты,
	|	ОКР(РАЗНОСТЬДАТ(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_ВремяНачалаРабот, ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_ВремяОкончанияРабот, МИНУТА) / 60, 1) КАК КоличествоЧасов,
	|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор КАК Договор
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВКМ_ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если АбонентскоеОбслуживание = Выборка.ВидДоговора 
			И Выборка.ДатаНачала < Выборка.ДатаРабот 
			И Выборка.ДатаРабот < Выборка.ДатаОкончания Тогда 
			
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.ВКМ_Клиент = Выборка.Клиент;
			Движение.ВКМ_Договор = Выборка.Договор;
			Движение.КоличествоЧасов = Выборка.КоличествоЧасов;
			Движение.СуммаКОплате = Выборка.СуммаОплаты;
			
		Иначе 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Период действия договора не соответствует дате проведения работ";
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
