
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ВКМ_Специалист) Тогда 
		
		ВКМ_Специалист = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЭтоНовый() Тогда
		
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка,
		               |	ВКМ_ОбслуживаниеКлиента.Номер КАК Номер,
		               |	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК Специалист,
		               |	ВКМ_ОбслуживаниеКлиента.ВКМ_ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		               |	ВКМ_ОбслуживаниеКлиента.ВКМ_ВремяНачалаРабот КАК ВремяНачалаРабот,
		               |	ВКМ_ОбслуживаниеКлиента.ВКМ_ВремяОкончанияРабот КАК ВремяОкончанияРабот
		               |ИЗ
		               |	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		               |ГДЕ
		               |	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка"; 
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.ДатаПроведенияРабот <> ВКМ_ДатаПроведенияРабот Тогда 
			НоваяДата = ВКМ_ДатаПроведенияРабот;
			ШаблонДата = "дата начала" + " " + Формат(НоваяДата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если Выборка.ВремяНачалаРабот <> ВКМ_ВремяНачалаРабот Тогда 
			НовоеВремяНачала = ВКМ_ВремяНачалаРабот;
			ШаблонВремяНачало = "время начала" + " " + Формат(НовоеВремяНачала, "ДФ=HH:mm");
		КонецЕсли;
		
		Если Выборка.ВремяОкончанияРабот <> ВКМ_ВремяОкончанияРабот Тогда 
			НовоеВремяОкончания = ВКМ_ВремяОкончанияРабот;
			ШаблонВремяОкончание = "время окончания" + " " + Формат(НовоеВремяОкончания, "ДФ=HH:mm");
		КонецЕсли;
		
		Если Выборка.Специалист <> ВКМ_Специалист Тогда 
			НовыйИсполнитель = ВКМ_Специалист;
			ШаблонИсполнитель = "исполнитель" + " " + НовыйИсполнитель;
		КонецЕсли;
		
		ОбъектУведомлениеТГ = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		ШаблонНаименование = "По документу № %1";
		ОбъектУведомлениеТГ.Наименование = СтрШаблон(ШаблонНаименование, Номер);
		ШаблонСообщения = "Внесены изменения: %2 %3 %4 %5";
		ОбъектУведомлениеТГ.Текст = СтрШаблон(ШаблонСообщения, ШаблонДата, ШаблонВремяНачало, ШаблонВремяОкончание,ШаблонИсполнитель);
		
		ОбъектУведомлениеТГ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы Приход
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	АбонентскоеОбслуживание = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор.ВидДоговора КАК ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор КАК ДоговорНаименование,
		|	ДЕНЬГОДА(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор.ВКМ_ДатаНачалаДействияДоговора) КАК ДатаНачалаДействияДоговора,
		|	ДЕНЬГОДА(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_ДатаПроведенияРабот) КАК ДатаПроведенияРабот,
		|	ДЕНЬГОДА(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор.ВКМ_ДатаОкончанияДействияДоговора) КАК ДатаОкончанияДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту * ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы КАК СуммаКОплате,
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
		|	ГОД(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_ДатаПроведенияРабот) КАК ГодПроведенияРабот,
		|	ГОД(ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка.ВКМ_Договор.ВКМ_ДатаОкончанияДействияДоговора) КАК ГодДействияДоговра
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВКМ_ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если АбонентскоеОбслуживание = Выборка.ВидДоговора 
			И Выборка.ДатаНачалаДействияДоговора < Выборка.ДатаПроведенияРабот 
			И Выборка.ДатаПроведенияРабот < Выборка.ДатаОкончанияДействияДоговора
			И Выборка.ГодДействияДоговра = Выборка.ГодПроведенияРабот Тогда 
			
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ВКМ_Клиент = Выборка.Клиент;
			Движение.ВКМ_Договор = Выборка.ДоговорНаименование;
			Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = Выборка.СуммаКОплате;
			
		Иначе 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата выполнения работ в не договора";
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры
