
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// {{repin_pv
	// По задаче скрыть Элементы 
	
	АбонентскоеОбслуживание = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Если АбонентскоеОбслуживание Тогда 
		
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	Иначе 
		
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь
		
	КонецЕсли;
		
	// repin_pv}}
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// {{repin_pv
	// По задаче скрыть Элементы
	
	АбонентскоеОбслуживание = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Если АбонентскоеОбслуживание Тогда 
		
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	Иначе
		
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь
				
	КонецЕсли
	
	// repin_pv}}
		
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ДатаНачалаДействияДоговораПриИзменении(Элемент)
	
	// {{repin_pv
	// По задаче Дата договора не может переходить на следущий год
	
	Объект.ВКМ_ДатаОкончанияДействияДоговора = КонецГода(Объект.ВКМ_ДатаНачалаДействияДоговора);
	
	// repin_pv}}
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// {{repin_pv
	// По задаче ГОД договора может быть только текущий 
	
	ГодНачала = Год(Объект.ВКМ_ДатаНачалаДействияДоговора);
	ГодОкончания = Год(Объект.ВКМ_ДатаОкончанияДействияДоговора);
	
	Если ГодНачала <> ГодОкончания Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Договор заключается на текущий год");
		Отказ = Истина;
		
	КонецЕсли;
	
	// repin_pv}}
	
КонецПроцедуры
